AcDbActionsToEvaluateCallback.needsToEvaluate(AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbAssocStatus,System.Boolean)
This callback method is called by AcDbAssocAction::getDependentActionsToEvaluate().
It is a mechanism by which getDependentActionsToEvaluate() informs that
an AcDbAssocAction, AcDbAssocDependency, or an AcDbObject needs to be
evaluated and suggests new status for them that the callback implementation
should set. If the given AcDbObjectId is not of an action or of a dependency,
but of an arbitrary AcDbObject, the callback implementation should simply
recursively call needsToEvaluate() for all dependencies on that object.
This callback does not need to be implemented by the client code. The
Associative Framework evaluation mechanism provides a default implementation
that it uses when calculating a transitive closure of all actions that
need to be evaluated.
objectId:
AcDbObjectId of an AcDbAssocAction, AcDbAssocDependency or an arbitrary
AcDbObject that needs to be evaluated.
newStatus:
The new evaluation request status of the action or dependency. If it
is not an evaluation request, the needsToEvaluate() implementation
should not change the status of the action or dependency.
ownedActionsAlso:
If the action that needs to evaluate is an AcDbAssocNetwork, this argument
controls whether all the actions owned by the network also need to be
evaluated. The caller usually passes true.

AcDbActionsToEvaluateCallback.Dispose
Virtual destructor.

AcDbActionsToEvaluateCallback.#ctor
Default constructor.

AcDbActionsToEvaluateCallback
This callback is used by AcDbAssocAction::getDependentActionsToEvaluate()
method to inform about other actions, dependencies or arbitrary objects that
should also be evaluated because they depend on the given action that is to
be evaluated.